{"config": [{"config": {"strides": [1, 1], "filters": 16, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_1", "trainable": true, "use_bias": true, "kernel_regularizer": null, "padding": "same", "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [5, 5], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "pool_size": [5, 5]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "filters": 16, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_2", "trainable": true, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "pool_size": [5, 5]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense_1", "units": 100, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense_2", "units": 1, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5"}