{"keras_version": "2.1.5", "config": {"output_layers": [["dense_4", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "name": "input_1", "sparse": false}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"output_layers": [["block5_pool", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_2", "sparse": false}, "name": "input_2", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 64, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block1_conv1", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block1_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 64, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block1_conv2", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block1_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "name": "block1_pool", "strides": [2, 2]}, "name": "block1_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 128, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block2_conv1", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block2_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 128, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block2_conv2", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block2_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "name": "block2_pool", "strides": [2, 2]}, "name": "block2_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 256, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block3_conv1", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block3_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 256, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block3_conv2", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block3_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 256, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block3_conv3", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block3_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "name": "block3_pool", "strides": [2, 2]}, "name": "block3_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 512, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block4_conv1", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block4_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 512, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block4_conv2", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block4_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 512, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block4_conv3", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block4_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "name": "block4_pool", "strides": [2, 2]}, "name": "block4_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 512, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block5_conv1", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block5_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 512, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block5_conv2", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block5_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"activity_regularizer": null, "filters": 512, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "name": "block5_conv3", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true}, "name": "block5_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "block5_pool", "strides": [2, 2]}, "name": "block5_pool", "class_name": "MaxPooling2D"}], "input_layers": [["input_2", 0, 0]], "name": "vgg16"}, "name": "vgg16", "class_name": "Model"}, {"inbound_nodes": [[["vgg16", 1, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "units": 100, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true}, "name": "dense_1", "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "units": 50, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true}, "name": "dense_2", "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true}, "name": "dense_3", "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_4", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true}, "name": "dense_4", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow", "class_name": "Model"}