{"keras_version": "2.1.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_1", "trainable": true, "kernel_size": [5, 5], "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "filters": 16, "padding": "same", "batch_input_shape": [null, 64, 64, 3]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "pool_size": [5, 5], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_2", "trainable": true, "kernel_size": [5, 5], "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "filters": 16, "padding": "same"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "pool_size": [5, 5], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "units": 100, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "units": 1, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}}], "backend": "tensorflow"}